Revit 2027 API
ContinuousRailType.EndOrTopTermination Property
 The termination of the rail at the end or top.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId EndOrTopTermination { get; set; }
Public Property EndOrTopTermination As ElementId
	Get
	Set
public:
property ElementId^ EndOrTopTermination {
	ElementId^ get ();
	void set (ElementId^ value);
}
member EndOrTopTermination : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The termination is not a valid termination symbol for continuous rail.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ContinuousRailType Class
Autodesk.Revit.DB.Architecture Namespace